Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་འཕྲོས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། ནུབ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems of the western direction, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དང་།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: །དེ་ནས་བྱང་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་རྒྱལ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Beyond all the world systems in the northern direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Jayā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Jayendra, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Jayadatta who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Jayendra was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་བ་དང་།
en: Going there, he asked that blessed one, the tathāgata Jayendra, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་ལྷོ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Jayendra, replied to the bodhisattva great being Jayadatta, “Noble son, south from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་གྱིས།
en: Such is his power.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བགྱི་ཞིང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀུན་ཀྱང་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ། གཟུངས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ་དེ་དག་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: Then the bodhisattva great being Jayadatta said to that blessed one, the tathāgata Jayendra, “Blessed Lord, I too will go to that world system of Patient Endurance to behold the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage and respect to him, and indeed to see all those bodhisattva great beings, most of whom are youthful ones, have acquired dhāraṇī and exact knowledge, and have mastered all the meditative stabilities and meditative absorptions.”

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །དེ་ནས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོས།
en: That blessed one, the tathāgata Jayendra, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་ལ། པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ་ཞེས་ཀྱང་གྱིས་ལ།
en: The tathāgata Jayendra gave the bodhisattva great being Jayadatta a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Jayendra, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: Then the bodhisattva great being Jayadatta received from that blessed one, the tathāgata, arhat, completely awakened Buddha Jayendra, those golden-colored, thousand-petaled lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དང་ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་འགྲོགས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས།
en: Accompanied by many hundred billion trillions of bodhisattvas in the form of householders, mendicants, young men, and young women, he vanished from that buddhafield.

source: བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ་མེ་ཏོག་དང་སྤོས་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་རྒྱན་དང་གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the northern direction, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, resided.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱལ་བའི་དབང་པོས། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེ་འམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ།
en: Having taken a place to one side, the bodhisattva great being Jayadatta then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Jayendra, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་དབང་པོས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། བྱང་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses, and scattered them in the world systems of the northern direction, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །ཆོས་བསྟན་པ་དེ་སེམས་ཅན་གང་གིས་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཏོ།
en: All beings who heard that teaching of the Dharma became assured of reaching unsurpassed, complete enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དང་ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་དེ་དག་གིས་ཀྱང་། རང་རང་གི་དགེ་བའི་རྩ་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་རིམ་གྲོར་བྱས་སོ། །བཀུར་སྟིར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ།
en: Those bodhisattvas in the form of householders, mendicants, young men, and young women also served, venerated, honored, and worshiped the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, with the roots of their respective virtuous actions, and then took places to one side. {

source: །མཆོད་པ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ནས་བྱང་ཤར་གྱི་ཕྱོགས་འཚམས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཏིང་ངེ་འཛིན་གྱིས་བརྒྱན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Dt.16} Beyond all the world systems in the northeastern intermediate direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Samādhyalaṅkṛta.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Samādhi­hastyuttara­śrī, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་། ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Vijayavikrāmin who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Samādhi­hastyuttara­śrī was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Going there, he asked that blessed one, the tathāgata Samādhi­hastyuttara­śrī, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: That blessed one, the tathāgata Samādhi­hastyuttara­śrī, replied to the bodhisattva great being Vijayavikrāmin, “Noble son, in the intermediate direction southwest from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར།
en: Such is his power.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བགྱི་ཞིང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀུན་ཀྱང་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ་གཟུངས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ་དེ་དག་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: The bodhisattva great being Vijayavikrāmin said to that blessed one, the tathāgata Samādhi­hastyuttara­śrī, “Blessed Lord, I too will go to that world system of Patient Endurance to behold the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage and respect to him, and indeed to see all those bodhisattva great beings, most of whom are youthful ones, have acquired dhāraṇī and exact knowledge, and have mastered all the meditative stabilities and meditative absorptions.”

source: །བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་ལྟར་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་གཉིས་པ། དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པ་ལ།
en: That blessed one, the tathāgata Samādhi­hastyuttara­śrī, then replied, “Go then, noble son, for I know the right time for this has arrived!”

source: པད་མོ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱུ་ལས་བྱུང་བ། གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་སྟོང་བསྐུར་ཏེ། རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ། བཅོམ་ལྡན་འདས་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གྱིས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ།
en: The tathāgata Samādhi­hastyuttara­śrī gave the bodhisattva great being Vijayavikrāmin a thousand lotus flowers, made of diverse jewels, golden in color, each with a thousand petals, and instructed him, “Noble son, you should scatter these lotuses toward the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, saying, ‘Blessed Lord, these golden-colored lotuses with a thousand petals have been sent as an offering to you, Blessed Lord, by that blessed one, the tathāgata Samādhi­hastyuttara­śrī, who inquires if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?’

source: །ཞེས་ཀྱང་གྱིས་ལ་པད་མོ་འདི་དག་གིས་གཏོར་ཅིག །རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལ་བག་ཡོད་པར་སྤྱོད་ཅིག །
en: Noble son, you should conduct yourself with care in that buddhafield.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་མགུ་བར་དཀའ་བ་ཡིན་གྱིས་དེར་ཉམས་པར་གྱུར་ཏ་རེ།
en: If you ask why, it is because bodhisattva great beings who are born in that world system are hard to satisfy. Beware of harm there.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་དེ་ལས། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་དེ་དག་བླངས་ཏེ།
en: The bodhisattva great being Vijayavikrāmin received from that blessed one, the tathāgata, arhat, completely awakened buddha Samādhi­hastyuttara­śrī, those golden-colored, thousand-petaled lotuses.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དང་། ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་འགྲོགས་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས།
en: Accompanied by many hundred billion trillions of bodhisattvas in the form of householders, mendicants, young men, and young women, he vanished from that buddhafield.

source: བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ལ་མེ་ཏོག་དང་། སྤོས་དང་བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་རྒྱན་དང་གདུགས་དང་རྒྱལ་མཚན་དང་བ་དན་དག་གིས་རིམ་གྲོར་བྱ་བ་དང་བཀུར་སྟིར་བྱ་བ་དང་བསྟི་སྟང་དུ་བྱ་བ་དང་མཆོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: After serving, respecting, honoring, and worshiping all the blessed lord buddhas who resided and were alive in the northeastern intermediate direction, as many as there were, with flowers, perfumes, incense, garlands, unguents, powders, robes, ornaments, parasols, victory banners, and ribbons, through the great miraculous ability of the bodhisattvas and through the great power of the bodhisattvas, he then set out for that place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, resided.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས།
en: Arriving there, he bowed his head toward the feet of the Blessed One and took a place to one side.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་རྒྱལ་བས་རྣམ་པར་གནོན་པས། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ། བཅོམ་ལྡན་འདས་ལ་སྙུན་མི་མངའ་འམ། གནོད་པ་མ་མཆིས་སམ། ཟོ་བདོག་བདེའམ། སྐུ་ཉམས་དང་ལྡན་ནམ། བདེ་བ་དང་དགྱེས་པར་སྤྱོད་དམ་ཞེས་འདྲི་སྟེ། པད་མོ་གསེར་གྱི་མདོག་ཅན་འདབ་མ་སྟོང་དང་ལྡན་པ་འདི་དག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་གླང་པོ་དམ་པའི་དཔལ་གྱིས།
en: Having taken a place to one side, the bodhisattva great being Vijayavikrāmin then addressed the Blessed One as follows: “That blessed one, the tathāgata, arhat, completely awakened Buddha Samādhi­hastyuttara­śrī, has sent these golden-colored, thousand-petaled lotuses as an offering to you, Blessed Lord, inquiring if you, Blessed Lord, are free from sickness, free from all harms, in good health, strong, comfortable, and well?”

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་སླད་དུ་བསྐུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་པད་མོ་དེ་དག་བཞེས་ནས། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གང་ན་བ་དེར་གཏོར་ཏོ།
en: The Blessed One, the tathāgata Śākyamuni, took those lotuses and scattered them in the world systems of the northeastern intermediate direction, numerous as the grains of sand of the river Gaṅgā, where the tathāgatas, arhats, completely awakened buddhas resided.

source: །དེ་ནས་པད་མོ་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏེ། པད་མོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མང་པོ་བཞུགས་ཤིང་འདི་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ།
en: The lotuses fully covered all those world systems, and upon them many bodies of the tathāgatas were seated, teaching this very doctrine, from the six perfections onward.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་པ་དང་རབ་ཏུ་བྱུང་བ་དང་ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སུ་འདུག་པ་དེ་དག་གིས་ཀྱང་རང་རང་གི་དགེ་བའི་རྩ་བས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་རིམ་གྲོར་བྱས་སོ། །བཀུར་སྟིར་བྱས་སོ། བསྟི་སྟང་དུ་བྱས་སོ། །མཆོད་པ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Those bodhisattvas in the form of householders, mendicants, young men, and young women also served, venerated, honored, and worshiped the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, with the roots of their respective virtuous actions, and then took places to one side.

source: དེ་ནས་ཤར་ལྷོའི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ཀུན་གྱི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་ཤིན་ཏུ་ཡིད་དུ་འོང་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: Beyond all the world systems in the southeastern intermediate direction, more numerous than the grains of sand of the river Gaṅgā, there is the world system called Bodhi­maṇḍalākāra­surucirā.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོ་དམ་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཤིང་འཚོ་སྐྱོང་སྟེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་ཡང་དག་པར་སྟོན་པ་མཛད་དོ།
en: There resides and lives the tathāgata, arhat, completely awakened buddha called Padmottaraśrī, teaching this very perfection of wisdom to bodhisattva great beings.

source: །དེ་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་པད་མོ་ཞེས་བྱ་བ་འདུག་འདུག་པས། སྣང་བ་ཆེན་པོ་དེ་དང་ས་ཆེར་གཡོས་པ་དེ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་བལྟ་ན་ཆོག་མི་ཤེས་པ་དེ་མཐོང་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོ་དམ་པའི་དཔལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: At that time, in that world system there was a bodhisattva great being named Padmahasta who, on beholding that great light, the great trembling of the earth, and the body of a tathāgata that one can never tire of beholding, set out for the place where that blessed one, the tathāgata, arhat, completely awakened Buddha Padmottaraśrī, was residing.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོ་དམ་པའི་དཔལ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འོད་ཆེན་པོ་འདི་ལྟ་བུ་འཇིག་རྟེན་དུ་བྱུང་བ་དང་། དོག་ས་འདི་ལྟར་ཆེར་གཡོས་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་ལྟ་བུ་གདའ་བ་འདི་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན།
en: Going there, he asked that blessed one, the tathāgata Padmottaraśrī, the following: “Blessed Lord, what are the causes and what are the conditions for such a great light to emerge in the world, for a narrow stretch of land to tremble in this manner, and for the body of a tathāgata, such as this, to be present?”

source: དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོ་དམ་པའི་དཔལ་གྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་པད་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ནས་ནུབ་བྱང་གི་ཕྱོགས་མཚམས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: The Blessed One, the tathāgata Padmottaraśrī, replied to the bodhisattva great being Padmahasta, “Noble son, in the intermediate direction northwest from here, beyond world systems numerous as the grains of sand of the river Gaṅgā, there is a world system called Patient Endurance.

source: འདི་ནི་དེའི་མཐུ་ཡིན་ཏེ་དེ་འདྲའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་པད་མོས།
en: Such is his power.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མོ་དམ་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་། དེ་ལ་ཕྱག་བགྱི་ཞིང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཀུན་ཀྱང་ཕལ་ཆེར་གཞོན་ནུར་གྱུར་པ། གཟུངས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པ་རབ་ཏུ་ཐོབ་པ། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ་དེ་དག་བལྟ་བའི་སླད་དུ་མཆིའོ།
en: Then the bodhisattva great being Padmahasta said to that blessed one, the tathāgata Padmottaraśrī, “Blessed Lord, I too will go to that world system of Patient Endurance to behold the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage and respect to him, and indeed to see all those bodhisattva great beings, most of whom are youthful ones, have acquired dhāraṇī and exact knowledge, and have mastered all the meditative stabilities and meditative absorptions.”
